# Cadence Genus(TM) Synthesis Solution, Version 16.13-s036_1, built Dec 20 2016

# Date: Mon Jul 08 21:51:48 2019
# Host: scc-pool-g-44 (x86_64 w/Linux 4.9.0-8-amd64) (4cores*4cpus*Intel(R) Core(TM) i5-4590 CPU @ 3.30GHz 6144KB)
# OS:   Unsupported OS as /etc does not have release info

source synthesize.tcl
read_sdc constraints.sdc 
report_qor 
report_qor > qor.txt
report_timing 
mkdir netlist
write_hdl > netlist/counter_top.gtl.v
ls
vim netlist/counter_top.gtl.v 
gui_raise
